SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 1938stockEast
	Type ( Engine )
	WagonShape ( 1938stockEast.s )
	Size  ( 2.62mm 2.6m 15.8m )
	CentreOfGravity ( 0m 2.25m 0m )
	Mass ( 40.5t )
	WheelRadius ( 0.85m )
	InertiaTensor ( Box (2.62m 2.6m 15.8m) )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 2e7N/m 0  )
			Damping ( 0.2e7N/m/s 0 )
			Break ( 2e7N 0 )
			r0 ( 0.1 1e9 )
		)
		CouplingHasRigidConnection ()
	)
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 5e6N/m 0 )
			Damping ( 1e6N/m/s 0)
			Break ( 2e7N 0 )
			r0 ( 15cm 1e9 )
		)
		CouplingHasRigidConnection ()
		Velocity ( 0.1m/s )
	)	
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)
	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 4cm )
	DerailRailForce ( 230kN )
	DerailBufferForce ( 200kN )
	NumWheels (	1 )
	Friction (
		150N/m/s		1		-1mph		0		1
		5.1N/rad/s		1		-1rad/s		0		1
	)

	AntiSlip ()
        

	MaxBrakeForce ( 100kN )
	BrakeEquipmentType( "EP_brake" )
	BrakeSystemType( "EP" )

	EmergencyBrakeResMaxPressure( 100 )
	TripleValveRatio( 2.5 )
	MaxReleaseRate( 15 )
	MaxApplicationRate( 15 )
	MaxAuxilaryChargingRate( 10 )
	EmergencyResCapacity( 10 )
	EmergencyResChargingRate( 12 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 70 )

	Lights	( 3
		Light	(
			comment( Sphere of light )
			Type( 1 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			Cycle	( 0 )
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			States	(	1
				State	(
							Duration ( 0.0 )
							LightColour ( ffffffff )
							Position ( 0.0 3.5 -1 )
							Transition ( 0 )
							Radius ( 100.0 )
							Angle ( 15.0 )
								)
				)
			)
			
		Light	(
			comment( Head light right dim )
			Type( 0 )
			Conditions (
				Headlight ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.73 1.25 -7.82 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.55 )
					Elevation ( 0.0 0.0 0.0 )
					)
				)
			)
			
			
		Light	(
			comment( Head light right bright )
			Type( 0 )
			Conditions (
				Headlight ( 3 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	( 1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 0.73 1.25 -7.82 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.55 )
					Elevation ( 0.0 0.0 0.0 )
						)
					)
				)
			)
					
 	Sound ( "2000Eng.sms" )
)

Engine ( 1938stockEast
	Wagon ( 1938stockEast )
	Type ( Electric )
	MaxPower ( 800kW )
	MaxForce ( 130kN#est )
	MaxContinuousForce ( 150kN )
	MaxVelocity ( 75mph )
	MaxCurrent ( 2000A )
	WheelRadius ( 0.85m )
	Sanding ( 1e9mph )
	NumWheels ( 1 )

	CabView ( 2000.cvf )

	AirBrakesAirCompressorPowerRating( 3 )
	AirBrakesMainMinResAirPressure( 30 )
	AirBrakesMainMaxAirPressure( 100 )
	AirBrakesMainResVolume( 6 )
	AirBrakesAirCompressorWattage( 20000 )
	AirBrakesCompressorRestartPressure( 100 )
	AirBrakesAirUsedPerPoundsOfBrakePipePressure( 0.8 )
	AirBrakesHasLowPressureTest( 1 )
	AirBrakesIsCompressorElectricOrMechanical( 1 )

	TrainBrakesControllerMaxApplicationRate( 20 )
	TrainBrakesControllerMaxReleaseRate( 12 )
	TrainBrakesControllerEmergencyApplicationRate( 45 )
	TrainBrakesControllerMinSystemPressure( 0 )
	TrainBrakesControllerMaxSystemPressure( 90 )
	TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
	TrainBrakesControllerFullServicePressureDrop( 36 )

	BrakesEngineControllers( "Train" )
	
	EmergencyStopMonitor(
   		MonitoringDeviceMonitorTimeLimit( 0 )
    		MonitoringDeviceAlarmTimeLimit( 0 )
    		MonitoringDevicePenaltyTimeLimit( 0 )
    		MonitoringDeviceCriticalLevel( 0 )
    		MonitoringDeviceResetLevel( 0 )
    		MonitoringDeviceAppliesFullBrake( 0 )
    		MonitoringDeviceAppliesEmergencyBrake( 1 )
    		MonitoringDeviceAppliesCutsPower( 1 )
    		MonitoringDeviceAppliesShutsDownEngine( 0 )
    		)

	AWSMonitor(
		MonitoringDeviceMonitorTimeLimit( -1 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 0 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 1 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutsDownEngine( 0 )
		)

        EngineControllers (
            Throttle ( 0 1 0.2 0 
                NumNotches ( 6
                Notch ( 0          0 Dummy )
                Notch ( 0.2        0 Dummy )
                Notch ( 0.4        0 Dummy )
                Notch ( 0.6        0 Dummy )
                Notch ( 0.8        0 Dummy )
                Notch ( 1          0 Dummy )
                 )
            )
            Brake_Train ( 0 1 0.0125 0.75 
                NumNotches ( 4
                    Notch( 0    1 TrainBrakesControllerReleaseStart )
                    Notch( 0.25 1 TrainBrakesControllerEPApplyStart )
                    Notch( 0.85 0 TrainBrakesControllerEPHoldStart )
                    Notch( 0.95 0 TrainBrakesControllerEmergencyStart )
                )
            )
            
            EmergencyStopToggle( 0 1 0 )
            Vigilance ( 0 1 0 )
            DirControl ( -1 0 1 1 )
            AWS ( 0 1 0 )
            Sanding ( 0 1 0 )
            Horn ( 0 1 0 )
            PantographToggle1 ( 0 1 1 )
            Headlights ( 0 0.25 1 0 )
            Wipers ( 0 1 0 )
        )
        
    	Sound ( "2000Cab.sms" )
    	Name ( "1938 Tube stock East")

    	Description (
	"The 1938 Stock was built by the Metro-Cammell Company in Birmingham.\n\n"+
	"They were part of the 1935-40 New Works programme.\n\n"+
	"Built from 1938, they were finally withdrawn during the 1980s\n\n"+
	"In 1989 a number of them went to the Isle of Wight.\n\n"+
	"A number of were converted to works stock"
	)

	EngineOperatingProcedures (
	"To move forward\n"+
 	"1. 	The pantograph has been raised for you. (If it is not up for some reason, press the P key to raise it.)\n"+
	"2.	Press the W key to move the Reverser to Forward.\n"+
	"3.	Press the ; (SEMICOLON) key to release the train brakes.\n"+
	"4.	Press the D key to move the throttle from Idle to Notch 1.\n"+  
	"5.	Gradually increase power (D key), one notch at a time, until your train reaches the desired speed.\n\n"+
	"To slow the train\n"+
	"1.	Press the A key to move the throttle to a lower setting.\n"+
	"2.	Use the brakes to further reduce speed if desired.\n\n"+   
	"To apply the train brakes\n"+
	"1.	Press the ' (APOSTROPHE) key to apply the train brakes.\n\n"+
	"To release the train brakes\n"+
	"1. Press the ; (SEMICOLON) key to release the train brakes.\n\n"+
	"To activate emergency braking\n"+
	"1.	Press the A key to reduce the throttle to Idle.\n"+
	"2.	Press the BACKSPACE key to activate emergency braking.\n\n"+
	"To back up\n"+
	"1.	Bring your train to a full stop.\n"+ 
	"2.	Press the S key to move the Reverser to the Reverse position.\n"+
	"4.	Press the ; (SEMICOLON) key to release the brakes.\n"+
	"5.	Slowly advance the throttle lever (D key).\n\n"+
	"To load and unload passengers\n"+
	"1. Stop at a station.\n"+
	"2. Press the ENTER key.\n"+
	"3. Wait for the 'permission to depart' signal.\n"+
	"TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
	"To couple to a car or locomotive\n"+
	"1. Coast into the unit at a very slow speed, about 4 Km/h.\n"+
	"TIP: To use the Coupling view, press the 6 key.\n"+
	"2. Press F9 to open the Train Operations window.\n"+
	"3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
	"4. Close the Train Operations window.\n\n"+
	"To uncouple from a car or locomotive\n"+
	"1. Press F9 to open the Train Operations window.\n"+
	"2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
	"3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
	"4. Close the Train Operations window."
	)
)
